Week_Seven/D3/MusicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "nQH3fotqZ8X44hCRXZeevg"], ["updated_at", "2020-03-25 23:16:59.249088"], ["id", 12]]
---
    def reset_session_token
        self.session_token = User.generate_session_token
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = User.find_by(email: email)