Week_Six/D5/router_controller_practice_pt2/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            comment = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            comment = Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]