Week_Six/D5/router_controller_practice_pt2/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        user = User.all