Week_Six/D5/router_controller_practice_p2/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        shares = ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 3], ["created_at", "2020-03-20 21:43:01.931696"], ["updated_at", "2020-03-20 21:43:01.931696"]]
---
    def create
        share = ArtworkShare.new(artwork_share_params)

        if share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 7]]
---
    def destroy
        share = ArtworkShare.find(params[:id])

        share.destroy