Week_Six/D5/router_controller_practice_p2/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id)
            owned = Artwork.where(artist_id: params[:user_id])
        end

        if params.has_key?(:user_id)
            shared = ArtworkShare.where(viewer_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 1]]

    def create
        art = Artwork.new(art_params)

        if art.save
---
INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Famine"], ["img_url", "starving.io"], ["artist_id", 1], ["created_at", "2020-03-20 20:59:43.341355"], ["updated_at", "2020-03-20 20:59:43.341355"]]

    def show
        art = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        art = Artwork.find(params[:id])

        if art.update(art_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Mango"], ["updated_at", "2020-03-20 21:04:35.835854"], ["id", 1]]

    def destroy
        art = Artwork.find(params[:id])

        art.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]