Week_Eight/D1/RedditClone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "T5lJQrfMoBoC2mDKYZiqhg"], ["updated_at", "2020-03-30 23:31:36.122584"], ["id", 1]]